Repository: KDE/spectacle
Catalog: po/*/spectacle.po
Languages: pt

# Keyboard action
source: + Shift: Move in 1 pixel steps
pt: + Shift: Mover em incrementos de 1 pixel

# Mouse action
source: Drag handles
pt: Pontos de redimensionamento

# Keyboard action
source: Arrow keys + Alt
pt: Teclas de seta + Alt

# Keyboard action
source: + Shift: Resize in 1 pixel steps
pt: + Shift: Redimensionar em incrementos de 1 pixel

# Mouse action
source: Right-click
pt: Botão direito

# Integer number of seconds
source: second
pt: segundo

# Decimal number of seconds
source: seconds
pt: segundos

# @title:window
source: %1 second
pt: %1 segundo

# @title:window Unsaved Screenshot
source: Unsaved
pt: Não guardado

source: Undo
pt: Desfazer

source: Redo
pt: Refazer

source: Zoom:
pt: Ampliação:

source: Image Zoom
pt: Ampliação de imagem

# @info, %1 is the error message
source: There was a problem sharing the image: %1
pt: Ocorreu um problema ao partilhar a imagem: %1

# @info
source: The shared image link (<a href="%1">%1</a>) has been copied to the clipboard.
pt: A ligação da imagem partilhada (<a href="%1">%1</a>) foi copiada para a área de transferência.

source: KDE Screenshot Utility
pt: Utilitário de Captura de Ecrã do KDE

# NAME OF TRANSLATORS
source: Your names
pt: César A. P. Cláudio

# EMAIL OF TRANSLATORS
source: Your emails
pt: cesarapclaudio@gmail.com

source: On Wayland, Spectacle requires KDE Plasma's KWin compositor, which does not seem to be available. Use Spectacle on KDE Plasma, or use a different screenshot tool.
pt: No Wayland, o Spectacle precisa do compositor KWin, do Plasma do KDE, que não parece estar disponível. Use o Spectacle no Plasma do KDE ou use uma ferramenta diferente para a captura do ecrã.

# @item:inlistbox
source: Orientation and Script Detection
pt: Deteção de Orientação e Texto Manuscrito

source: Math/Equation Detection
pt: Deteção de Expressões Matemáticas/Equações

source: Orientation and Script Detection
pt: Deteção de Orientação e Texto Manuscrito

# @info, %1 is the width
source: Bad width for KWin screenshot: %1
pt: Largura inadequada para a captura de ecrã do KWin: %1

# @info, %1 is the height
source: Bad height for KWin screenshot: %1
pt: Altura inadequada para captura de ecrã do KWin: %1

# @info, %1 is a file format like 'png', 'jpg'
source: Bad format for KWin screenshot: %1
pt: Formato inválido para a captura de ecrã do KWin: %1

# @info
source: Could not open file descriptor for reading KWin screenshot.
pt: Não foi possível abrir o descritor de ficheiro para leitura da captura de ecrã do KWin.

# @info, %1 is an error code
source: pipe2() failed for KWin screenshot: %1
pt: pipe2() falhou para a captura de ecrã do KWin: %1

# @info, %1 is an error message
source: KWin screenshot request failed: %1
pt: O pedido de captura de ecrã do KWin falhou: %1

# @info
source: Potentially relevant information: %1
pt: Informação potencialmente relevante: %1

# @info
source: Unsupported KWin screenshot type metadata: %1
pt: Metadados de tipo de captura de ecrã KWin não suportados: %1

# @info
source: Screen recording is not available on X11.
pt: Gravar o ecrã não está disponível no X11.

# @info
source: KWin Screencasting is not available.
pt: A gravação de ecrã do KWin não está disponível.

# @info:shell
source: Failed to record: File URL is not a local file
pt: Não foi possível fazer gravação: O URL não é um ficheiro local.

# @info
source: The stream closed because the target screen changed in a way that disrupted the recording.
pt: A transmissão terminou porque o ecrã alvo sofreu uma alteração que afetou a gravação.

# @info
source: The stream closed because the target window changed in a way that disrupted the recording.
pt: A transmissão terminou porque a janela alvo sofreu uma alteração que afetou a gravação.

# @info
source: The stream closed because a screen containing the target region changed in a way that disrupted the recording.
pt: A transmissão terminou porque o ecrã que continha a região alvo sofreu uma alteração que afetou a gravação.

# @info:shell, %1 is the temporary URL
source: Failed to record: Temporary file URL is not a local file (%1)
pt: Não foi possível fazer gravação: O URL temporário não é um ficheiro local (%1)

# @info:shell, %1 is the output file URL
source: Failed to record: Output file URL is not a local file (%1)
pt: Não foi possível fazer gravação: O URL de destino não é um ficheiro local (%1)

# @info:shell, %1 is a directory path
source: Failed to record: Unable to create folder (%1)
pt: Não foi possível fazer gravação: Não foi possível criar pasta (%1)

# @info:shell
source: Screen recording canceled
pt: Gravação de ecrã cancelada

# @info:shell
source: Window recording canceled
pt: Gravação de janela cancelada

# @info:shell, %1 is an error message
source: Failed to select screen: %1
pt: Não foi possível selecionar ecrã: %1

# @info:shell, %1 is an error message
source: Failed to select window: %1
pt: Não foi possível selecionar janela: %1

# @info:shell
source: Failed to select screen: No screen contained the mouse cursor position
pt: Não foi possível selecionar ecrã: Nenhum ecrã continha a posição do cursor

# @info:shell
source: Failed to select window: No window found
pt: Não foi possível selecionar janela: Nenhuma janela encontrada

# @item recording mode
source: Rectangular Region
pt: Região Retangular

# @item recording mode
source: Window
pt: Janela

# @item recording mode
source: Full Screen
pt: Ecrã Completo

# @action global shortcut
source: Launch Spectacle
pt: Iniciar o Spectacle

# @action global shortcut
source: Capture Entire Desktop
pt: Capturar Ambiente de Trabalho Inteiro

# @action global shortcut
source: Capture Current Monitor
pt: Capturar Monitor Atual

# @action global shortcut
source: Capture Active Window
pt: Capturar Janela Ativa

# @action global shortcut
source: Capture Rectangular Region
pt: Capturar Região Retangular

# @action global shortcut
source: Capture Selected Window
pt: Capturar Janela Selecionada

# @action global shortcut
source: Capture Window Under Cursor
pt: Capturar Janela sob o Cursor

# @action global shortcut
source: Start/Stop Screen Recording
pt: Iniciar/Parar Gravação de Ecrã

# @action global shortcut
source: Start/Stop Window Recording
pt: Iniciar/Parar Gravação de Janela

# @action global shortcut
source: Start/Stop Region Recording
pt: Iniciar/Parar Gravação de Região

# @action global shortcut
source: Launch Spectacle without capturing
pt: Iniciar o Spectacle sem capturar

# @info
source: An error occurred while taking a screenshot.
pt: Ocorreu um erro ao capturar o ecrã.

# @info:tooltip title for recording tray icon
source: Spectacle is Recording
pt: O Spectacle está a gravar

# recording notification title
source: Spectacle is Recording
pt: O Spectacle está a gravar

# recording notification message without shortcut
source: To finish the recording, click the pulsing red System Tray icon.
pt: Para terminar a gravação, clique no ícone vermelho a pulsar na Área de Notificação.

# recording notification message with shortcut
source: To finish the recording, click the pulsing red System Tray icon or press <shortcut>%1</shortcut>.
pt: Para terminar a gravação, clique no ícone vermelho a pulsar na Área de Notificação ou pressione <shortcut>%1</shortcut>.

# missing webp support notification title
source: WebP support is missing.
pt: Suporte WebP em falta.

# missing webp support notification message
source: Please install Qt Image Formats to get animated system tray icons for Spectacle, and then report this packaging issue to your distributor.
pt: Por favor instale o 'Qt Image Formats' para o Spectacle exibir ícones animados na área de notificação e depois reporte este problema de dependências à sua distribuição.

# recording notification title
source: Spectacle is Finishing the Recording
pt: O Spectacle está a terminar a gravação

# recording notification message
source: Please wait
pt: Por favor aguarde

# @info:tooltip title for rendering tray icon
source: Spectacle is Finishing the Recording
pt: O Spectacle está a terminar a gravação

# @info:tooltip subtitle for rendering tray icon
source: Time recorded: %1 Click to stop rendering early (this will lose data)
pt: Time recorded: %1 Clique para interromper a renderização (isto resultará em perda de dados).

# @info:tooltip subtitle for recording tray icon
source: Time recorded: %1 Click to finish recording
pt: Tempo de gravação: %1 Clique para terminar gravação

# @info
source: An error occurred while attempting to record the screen.
pt: Ocorreu um erro ao tentar efetuar uma gravação de ecrã.

# @info
source: The screenshot was copied to the clipboard and saved as <link url="%1">%2</link>
pt: A capturada de ecrã foi copiada para a área de transferência e guardada como <link url="%1">%2</link>

# @info
source: The screenshot has been saved as <link url="%1">%2</link> and its location has been copied to clipboard
pt: A captura de ecrã foi guardada como <link url="%1">%2</link> e a sua localização foi copiada para a área de transferência

# @info
source: The screenshot was saved as <link url="%1">%2</link>
pt: A captura de ecrã foi guardada como <link url="%1">%2</link>

# @info
source: The screenshot has been copied to the clipboard.
pt: A captura de ecrã foi copiada para a área de transferência.

# @info
source: The video has been saved as <link url="%1">%2</link> and its location has been copied to clipboard
pt: O vídeo foi guardado como <link url="%1">%2</link> e a sua localização foi copiada para a área de transferência

# @info
source: The video was saved as <link url="%1">%2</link>
pt: O vídeo foi guardado como <link url="%1">%2</link>

# @info
source: The video location has been copied to the clipboard.
pt: A localização do vídeo foi copiada para a área de transferência.

# @info
source: Code found: %1
pt: Código encontrado: %1

# @info
source: Found QR code with binary content.
pt: Encontrado código QR com conteúdo binário.

# @info
source: Text extraction failed
pt: Extração de texto falhou

# @info
source: No text found in the image
pt: Nenhum texto encontrado na imagem

# @info
source: Text extraction completed
pt: Extração de texto concluída

# @info:notification title
source: Text Extracted
pt: Texto extraído

# @info The variables are language names, e.g. 'English and German'
source: %1 and %2
pt: %1 e %2

# @info:notification
source: Text copied to clipboard.<nl/>Languages used: %1
pt: Texto copiado para a área de transferência.<nl/>Idiomas utilizados: %1

# @action:button
source: Open in Text Editor
pt: Abrir no Editor de Texto

# @info
source: Please select a region before extracting text
pt: Por favor selecione uma região antes de extrair o texto

# @info
source: OCR is not available.
pt: OCR não disponível

# @info
source: No screenshot available.
pt: Nenhuma captura de ecrã disponível.

# @info
source: Extracting text from image...
pt: A extrair texto da imagem...

# @info:shell
source: %1 is not a valid mode for --record
pt: %1 não é um modo válido para --record

# %1 is the filename, %2 the path to the save location
source: A screenshot was saved as '%1' to '%2' and the file path of the screenshot has been saved to your clipboard.
pt: Uma captura de ecrã foi guardada como '%1' em '%2' e o caminho do ficheiro foi copiado para a sua área de transferência.

# %1 is the filename
source: A screenshot was saved as '%1' to your Pictures folder.
pt: Uma captura de ecrã foi guardada como '%1' na sua pasta de Imagens.

# %1 is the filename, %2 the path to the save location
source: A screenshot was saved as '%1' to '%2'.
pt: Uma captura de ecrã foi guardada como '%1' em '%2'.

source: A screenshot was saved to your clipboard.
pt: Uma captura de ecrã foi copiada para a sua área de transferência.

# %1 is the filename, %2 the path to the save location
source: A recording was saved as '%1' to '%2' and the file path of the recording has been saved to your clipboard.
pt: Uma gravação de ecrã foi guardada como '%1' em '%2' e o caminho do ficheiro foi copiado para a sua área de transferência.

# %1 is the filename
source: A recording was saved as '%1' to your Videos folder.
pt: Uma gravação de ecrã foi guardada como '%1' na sua pasta de Vídeos.

# %1 is the filename, %2 the path to the save location
source: A recording was saved as '%1' to '%2'.
pt: Uma gravação de ecrã foi guardada como '%1' em '%2'.

# Open the screenshot we just saved
source: Open
pt: Abrir

source: Annotate
pt: Anotar

# @item:inlistbox Container/encoder
source: Animated WebP (better than GIF)
pt: WebP animado (melhor que GIF)

# @item:inlistbox Container/encoder
source: GIF (compatible, but inefficient)
pt: GIF (compatível mas ineficiente)
