Repository: KDE/spectacle
Catalog: po/*/spectacle.po
Languages: pt

# translatable folder name
source: Screenshots
pt: Capturas de ecrã

# part of default image filename template
source: Screenshot
pt: Captura de ecrã

# translatable folder name
source: Screencasts
pt: Gravações de Ecrã

# part of default video filename template
source: Screencast
pt: Gravação de Ecrã

# @action in capture mode section
source: Rectangular Region
pt: Região Retangular

# @action in capture mode section
source: All Screens (Scaled to same size)
pt: Todos os Ecrãs (Ajustado ao mesmo tamanho)

# @action in capture mode section
source: Current Screen
pt: Ecrã Atual

# @action in capture mode section
source: Active Window
pt: Janela Ativa

# @action in capture mode section
source: Select Window
pt: Selecionar Janela

# @action in capture mode section
source: Window Under Cursor
pt: Janela Sob Cursor

# @action in capture mode section
source: All Screens
pt: Todos os Ecrãs

# @action in capture mode section
source: Full Screen
pt: Ecrã Completo

source: Capture the entire desktop (default)
pt: Capturar todo o ambiente de trabalho (padrão)

source: Capture the current monitor
pt: Capturar o monitor atual

source: Capture the active window
pt: Capturar a janela ativa

source: Capture the window currently under the cursor, including parents of pop-up menus
pt: Capturar a janela atualmente sob o cursor, incluindo as janelas principais dos elementos gráficos

source: Capture the window currently under the cursor, excluding parents of pop-up menus
pt: Capturar a janela atualmente sob cursor, excluindo as janelas principais dos elementos gráficos

source: Capture a rectangular region of the screen
pt: Capturar uma região retangular do ecrã

source: Record the screen using the given mode. Modes: - r, region - s, screen - w, window
pt: Fazer gravação de ecrã utilizando o respetivo modo. Modos: - r, região - s, ecrã - w, janela

source: Launch Spectacle without taking a screenshot
pt: Iniciar o Spectacle sem fazer captura de ecrã

source: Start in GUI mode (default)
pt: Iniciar no modo gráfico (padrão)

source: Take a screenshot and exit without showing the GUI
pt: Capturar o ecrã e sair sem mostrar a interface gráfica

source: Start in DBus-Activation mode
pt: Iniciar no modo de ativação por D-Bus

source: In background mode, do not pop up a notification when the screenshot is taken
pt: No modo de segundo plano, mostrar uma notificação quando for feita uma captura de ecrã

source: In background mode, save image to specified file
pt: No modo de segundo plano, guardar imagem no ficheiro especificado

source: In background mode, delay before taking the shot (in milliseconds)
pt: No modo de segundo plano, definir atraso antes de capturar ecrã (em milissegundos)

source: In background mode, copy screenshot image to clipboard, unless -o is also used.
pt: No modo de segundo plano, copiar imagem para a área de transferência, excepto se também for usada a opção '-o'.

source: In background mode, copy screenshot file path to clipboard
pt: No modo de segundo plano, copiar o caminho do ficheiro para a área de transferência

source: Wait for a click before taking screenshot. Invalidates delay
pt: Aguardar por um clique antes de fazer a captura de ecrã. Invalida o valor de atraso especificado

source: Starts a new GUI instance of spectacle without registering to DBus
pt: Inicia nova instância de interface gráfica do Spectacle sem se registar no DBus

source: In background mode, include pointer in the screenshot
pt: No modo de segundo plano, incluir cursor na captura de ecrã

source: In background mode, exclude decorations in the screenshot
pt: No modo de segundo plano, excluir decorações de janela na captura de ecrã

source: In background mode, exclude shadows in the screenshot
pt: No modo de segundo plano, excluir sombras de janela na captura de ecrã

source: Open and edit existing screenshot file
pt: Abrir e editar o ficheiro de captura de ecrã existente

# %1 is an error message
source: QImageWriter cannot write image: %1
pt: Não foi possível ao QImageWriter gravar a imagem: %1

# @info
source: Cannot save screenshot because creating the directory failed:<nl/><filename>%1</filename>
pt: Não foi possível guardar captura de ecrã, a criação de pasta falhou:<nl/><filename>%1</filename>

source: Cannot save screenshot. Error while writing file.
pt: Não foi possível guardar captura de ecrã. Ocorreu um erro ao gravar o ficheiro.

# @info
source: Cannot save screenshot because creating the remote directory failed:<nl/><filename>%1</filename>
pt: Não foi possível guardar captura de ecrã, a criação de pasta remota falhou: <nl/><filename>%1</filename>

source: Cannot save screenshot. Error while writing temporary local file.
pt: Não foi possível guardar captura de ecrã. Ocorreu um erro ao gravar o ficheiro temporário local.

source: Unable to save image. Could not upload file to remote location.
pt: Não foi possível guardar imagem. Não foi possível enviar o ficheiro para uma localização remota.

source: Cannot save screenshot. The save filename is invalid.
pt: Não foi possível guardar captura de ecrã. O nome de ficheiro é inválido.

source: Cannot save an empty screenshot image.
pt: Não é possível guardar uma captura de ecrã vazia.

# @info:shell
source: Failed to export video: Temporary file URL must be an existing local file
pt: Exportação de vídeo falhou: O URL do ficheiro temporário deve ser um ficheiro local existente

# @info:shell
source: Failed to export video: Output file URL must be a valid URL with a file name
pt: Exportação de vídeo falhou: O URL do ficheiro de saída deve ser um URL válido com um nome de ficheiro.

# @info, %1 is a file path
source: Unable to save recording. Could not move file to location: %1
pt: Não foi possível guardar gravação. Não foi possível mover o ficheiro para a localização: %1

source: Printing failed. The printer failed to initialize.
pt: A impressão falhou. Não foi possível inicializar a impressora.

# filename placeholder description
source: Day (1–31)
pt: Dia (1–31)

# filename placeholder description
source: Day (01–31)
pt: Dia (01–31)

# filename placeholder description
source: Day (short name)
pt: Dia (abreviatura)

# filename placeholder description
source: Day (long name)
pt: Dia (por extenso)

# filename placeholder description
source: Month (1–12)
pt: Mês (1–12)

# filename placeholder description
source: Month (01–12)
pt: Mês (01–12)

# filename placeholder description
source: Month (short name)
pt: Mês (abreviatura)

# filename placeholder description
source: Month (long name)
pt: Mês (por extenso)

# filename placeholder description
source: Year (2 digit)
pt: Ano (2 algarismos)

# filename placeholder description
source: Year (4 digit)
pt: Ano (4 algarismos)

# filename placeholder description
source: Hour (0–23)
pt: Hora (0–23)

# filename placeholder description
source: Hour (00–23)
pt: Hora (00–23)

# filename placeholder description
source: Hour (1–12)
pt: Hora (1–12)

# filename placeholder description
source: Hour (01–12)
pt: Hora (01–12)

# filename placeholder description
source: Minute (0–59)
pt: Minuto (0–59)

# filename placeholder description
source: Minute (00–59)
pt: Minuto (00–59)

# filename placeholder description
source: Second (0–59)
pt: Segundo (0–59)

# filename placeholder description
source: Second (00–59)
pt: Segundo (00–59)

# filename placeholder description
source: Millisecond (0–999)
pt: Milissegundos (0–999)

# filename placeholder description
source: Millisecond (000–999)
pt: Milissegundos (000–999)

# filename placeholder description
source: AM/PM or am/pm (localized)
pt: AM/PM ou am/pm (localizado)

# filename placeholder description
source: Timezone (short name)
pt: Fuso horário (abreviatura)

# filename placeholder description
source: Timezone offset (±0000)
pt: Desvio de fuso horário (±0000)

# filename placeholder description
source: Timezone offset (±00:00)
pt: Desvio de fuso horário (±00:00)

# filename placeholder description
source: Timezone (long name)
pt: Fuso horário (por extenso)

# filename placeholder description
source: Seconds since the Unix epoch
pt: Segundos desde a época Unix

# filename placeholder description
source: Window Title
pt: Título da Janela

# filename placeholder description
source: Sequential numbering, padded by inserting additional '#' characters
pt: Numeração sequencial, preenchida com caracteres '#' adicionais

# @action accept selection
source: Accept
pt: Aceitar

source: Stroke:
pt: Traço:

source: Stroke Width
pt: Espessura do Traço

source: Stroke Color
pt: Cor do Traço

source: Fill:
pt: Preenchimento:

source: Fill Color
pt: Cor do Preenchimento

# @label:slider strength of effect
source: Strength:
pt: Força:

# @info:tooltip
source: The strength of the effect.
pt: A força do efeito.

source: Font:
pt: Tipo de letra:

source: Font Color
pt: Cor do Texto

source: Number:
pt: Número:

source: Number for number annotations
pt: Número para as anotações numéricas

source: Shadow
pt: Sombra

# @action:intoolbar no tool, to allow dragging
source: None
pt: Nenhum

# @action:intoolbar crop image tool
source: Crop
pt: Recortar

# @action:intoolbar select annotation tool
source: Select
pt: Selecionar

# @action:intoolbar freehand line tool
source: Freehand
pt: Forma Livre

# @info:tooltip
source: Shift: Snap to straight lines
pt: Shift: Desenhar linhas retas

# @action:intoolbar highlighter line tool
source: Highlighter
pt: Realce de texto

# @action:intoolbar straight line tool
source: Line
pt: Linha

# @info:tooltip
source: Shift: Snap to 45 degree increments
pt: Shift: Ajustar em incrementos de 45 graus

# @action:intoolbar arrow line tool
source: Arrow
pt: Seta

# @action:intoolbar rectangle tool
source: Rectangle
pt: Retângulo

# @info:tooltip
source: Shift: Snap to diagonal movements Control: Resize from center
pt: Shift: Ajustar em movimentos diagonais Control: Redimensionar a partir do centro

# @action:intoolbar ellipse tool
source: Ellipse
pt: Elipse

# @action:intoolbar pixelate tool
source: Pixelate
pt: Pixelizar

# @action:intoolbar blur tool
source: Blur
pt: Desfocar

# @action:intoolbar text tool
source: Text
pt: Texto

# @action:intoolbar number stamp tool
source: Number
pt: Número

# @action cancel selection
source: Cancel
pt: Cancelar

source: Cancel (%1 second)
pt: Cancelar (%1 segundo)

source: Take a new screenshot
pt: Fazer nova captura de ecrã

# @title:group
source: Screenshot Settings
pt: Configurações de Captura de Ecrã

# @info basic crop tool explanation
source: Click and drag to make a selection.
pt: Clique e arraste para fazer uma seleção.

source: Include mouse pointer
pt: Incluir cursor do rato

source: Show the mouse cursor in the screenshot image.
pt: Mostrar o cursor do rato na captura de ecrã.

source: Include window titlebar and borders
pt: Incluir decorações e contornos da janela

source: Show the window title bar and border when taking a screenshot of a window.
pt: Mostrar a barra de título e o contorno ao capturar uma janela.

source: Include window shadow
pt: Incluir sombra da janela

source: Show the window shadow when taking a screenshot of a window.
pt: Mostrar a sobra da janela ao fazer uma captura de janela.

source: Capture the current pop-up only
pt: Capturar apenas o elemento gráfico atual

source: Capture only the current pop-up window (like a menu, tooltip etc) when taking a screenshot of a window. If disabled, the pop-up is captured along with the parent window.
pt: Capturar apenas o elemento gráfico atual (como um menu, dica, etc.). Se desativado, o elemento gráfico é capturado juntamente com a janela principal.

source: Quit after manual Save or Copy
pt: Sair após Guardar ou Copiar manualmente

source: Quit Spectacle after manually saving or copying the image.
pt: Sair do Spectacle após guardar ou copiar manualmente a imagem.

source: Capture on click
pt: Capturar ao clicar

source: Wait for a mouse click before capturing the screenshot image.
pt: Aguardar por um clique antes de capturar o ecrã.

source: Delay:
pt: Atraso:

# @action
source: Copy
pt: Copiar

# @action
source: Copy Location
pt: Copiar Localização

# 0 second delay
source: No Delay
pt: Sem Atraso

# Integer number of seconds
source: %2 second
pt: %2 segundo

# Decimal number of seconds
source: %1 seconds
pt: %1 segundos

source: Configure Spectacle…
pt: Configurar o Spectacle…

source: Help
pt: Ajuda

# @title:group
source: Take a Screenshot:
pt: Faça uma Captura de Ecrã:

# @title:group
source: Options
pt: Opções

# @title:group
source: Make a Recording:
pt: Faça uma Gravação de Ecrã:

# @title:tab
source: Screenshot
pt: Captura de Ecrã

# @title:tab
source: Recording
pt: A gravar

# @action edit screenshot
source: Edit…
pt: Editar...

# @title:menu
source: Export
pt: Exportar

source: Open Default Screenshots Folder
pt: Abrir Pasta Predefinida de Capturas de Ecrã

# @action:button open screenshot in other application
source: Other Application…
pt: Outra Aplicação...

source: Share
pt: Partilhar

# @action:menu
source: Extract Text by Language
pt: Extrair Texto por Idioma

source: OCR engine is not available.
pt: O motor de OCR não está disponível.

source: OCR is not available. Please install Tesseract OCR.
pt: OCR não disponível. Por favor instale o Tesseract OCR.

source: OCR engine is initializing…
pt: O motor de OCR está a inicializar...

source: No OCR language data available.
pt: Nenhum pacote de idioma para OCR disponível.

# @action
source: Export
pt: Exportar

# @title:menu
source: Help
pt: Ajuda

# @action
source: Help
pt: Ajuda

# @action:button
source: Open Containing Folder
pt: Abrir Localização do Ficheiro

# @action:button
source: Copy to Clipboard
pt: Copiar para a área de transferência

# @action:button close inline notification
source: Close
pt: Fechar

source: New Screenshot
pt: Nova Captura de Ecrã

# @action
source: Extract Text
pt: Extrair Texto

# @title:menu
source: Screenshot Settings
pt: Configurações de Captura de Ecrã

# @option:check for screenshots
source: Include mouse pointer
pt: Incluir cursor do rato

# @info:tooltip
source: Show the mouse cursor in the screenshot image
pt: Mostrar o cursor do rato na captura de ecrã

# @option:check
source: Include window titlebar and borders
pt: Incluir a barra de título e contornos da janela

# @info:tooltip
source: Show the window title bar, the minimize/maximize/close buttons, and the window border
pt: Mostrar a barra de título, os botões de minimizar/maximizar/fechar e o contorno da janela

# @option:check
source: Include window shadow
pt: Incluir sombra da janela

# @info:tooltip
source: Show the window shadow
pt: Mostrar a sombra da janela

# @option:check
source: Capture the current pop-up only
pt: Capturar apenas o elemento gráfico atual

# @info:tooltip
source: Capture only the current pop-up window (like a menu, tooltip etc). If disabled, the pop-up is captured along with the parent window
pt: Capturar apenas o elemento gráfico atual (como um menu, dica, etc.). Se desativado, o elemento gráfico é capturado juntamente com a janela principal

# @option:check
source: Quit after manual Save or Copy
pt: Sair após Gravar ou Copiar manualmente

# @info:tooltip
source: Quit Spectacle after manually saving or copying the image
pt: Sair do Spectacle após gravar ou copiar manualmente a imagem

# @option:check
source: Capture On Click
pt: Capturar ao Clicar

# @label:spinbox
source: Delay:
pt: Atraso:

# @item 0 delay special value
source: No Delay
pt: Sem Atraso

# @title:menu
source: Recording Settings
pt: Configurações de Gravação

# @option:check for recordings
source: Include mouse pointer
pt: Incluir cursor do rato

# @info:tooltip
source: Show the mouse cursor in the recording
pt: Mostrar cursor do rato na gravação de ecrã

# @action
source: Options
pt: Opções

# @action start recording
source: Record
pt: Gravar

# @title:menu
source: Recording Modes
pt: Modos de Gravação

# @action select new recording mode
source: New Recording
pt: Nova Gravação

source: Show the mouse cursor in the screen recording.
pt: Mostrar o cursor do rato na gravação de ecrã.

# Recording in progress, %1 is the length of the recording so far
source: Recording: %1
pt: A gravar: %1

source: Pause
pt: Pausa

source: Play
pt: Reproduzir

source: Recording Settings
pt: Configurações de Gravação

source: Finish recording
pt: Terminar gravação

# @action
source: Save
pt: Guardar

# @action
source: Save As…
pt: Guardar como...

# @title:menu
source: Screenshot Modes
pt: Modos de Captura de Ecrã

# @action select new screenshot mode
source: New Screenshot
pt: Nova Captura de Ecrã

# @info crop tool explanation
source: Click and drag to make a selection. Double click the selection to accept and crop. Right click to clear the selection.
pt: Clique e arraste para fazer uma seleção. Faça duplo clique na seleção para aceitar e recortar. Botão direito do rato para limpar a seleção.

source: When launching Spectacle:
pt: Ao iniciar o Spectacle:

source: Take rectangular screenshot
pt: Fazer captura de ecrã retangular

source: Take full screen screenshot
pt: Fazer captura de ecrã inteiro

source: Use last-used capture mode
pt: Utilizar o último modo de captura selecionado

source: Do not take a screenshot automatically
pt: Não fazer captura de ecrã automaticamente

source: After taking a screenshot:
pt: Depois de fazer captura de ecrã:

source: Save file to default folder
pt: Guardar ficheiro na pasta predefinida

source: Do not copy anything
pt: Não copiar nada

source: Copy image to clipboard
pt: Copiar a imagem para a área de transferência

source: Copy file location to clipboard
pt: Copiar a localização do ficheiro para a área de transferência

source: While Spectacle is running
pt: Quando o Spectacle está em execução

source: Press screenshot key to:
pt: Carregue na tecla de fotografias para:

source: Take a new Screenshot
pt: Tirar uma Nova Fotografia

source: Open a new Spectacle window
pt: Abrir uma nova janela do Spectacle

source: Return focus to Spectacle
pt: Voltar a colocar o Spectacle em primeiro plano

source: Rectangular Region Selection
pt: Seleção de Região Retangular

source: General:
pt: Geral:

source: Use light background
pt: Utilizar um fundo claro

source: Accept on click-and-release
pt: Aceitar ao clicar-e-largar

source: Show magnifier:
pt: Mostrar lupa:

source: Never
pt: Nunca

source: Always
pt: Sempre

source: While holding Shift
pt: Enquanto pressiona Shift

source: Remember selected area:
pt: Memorizar área selecionada:

source: Until Spectacle is closed
pt: Até fechar o Spectacle

source: Text Recognition (OCR)
pt: Reconhecimento de texto (OCR)

source: Languages for OCR:
pt: Idiomas para OCR:

source: Text extraction:
pt: Extração de texto:

source: Close after extraction (skips auto-save)
pt: Fechar após extração (ignora guardar automático)

source: Spectacle will close after text extraction and automatic saving will be skipped.
pt: O Spectacle fechará após a extração de texto e guardar automaticamente será ignorado.

source: OCR functionality is not available
pt: A funcionalidade de OCR não está disponível

source: Please install the required packages: • tesseract • tesseract language data (e.g., tesseract-ocr-eng for English)
pt: Por favor instale os pacotes necessários: • tesseract • pacote de idioma para o tesseract (p.ex., 'tesseract-data-por' para Português)

source: Save Location:
pt: Guardar em:

source: Compression Quality:
pt: Qualidade de Compressão:

source: For lossy image formats like JPEG
pt: Para formatos de imagem com perdas, como o JPEG

source: Filename:
pt: Nome do ficheiro:

# Preview of the user configured filename
source: Preview:
pt: Pré-visualização:

source: You can use the following placeholders in the filename, which will be replaced with actual text when the file is saved:
pt: Pode utilizar as seguintes substituições, que serão substituídas pelo texto correspondente quando guardar o ficheiro:

source: To save to a sub-folder
pt: Para guardar numa subpasta

# show fewer filename placeholder templates
source: Show Fewer
pt: Mostrar menos

# show more filename placeholder templates
source: Show More
pt: Mostrar mais

# Settings category
source: General
pt: Geral

# Settings category
source: Image Saving
pt: Opções de Imagem

# Settings category
source: Video Saving
pt: Opções de Vídeo

# Settings category
source: Shortcuts
pt: Atalhos

source: Shortcuts
pt: Atalhos de Teclado

source: What to do when Spectacle is launched
pt: O que fazer quando o Spectacle for iniciado

source: What should happen if print key is pressed when Spectacle is already running
pt: O que deverá acontecer se pressionar a tecla Print com o Spectacle já em execução

source: Save screenshot automatically after it is taken
pt: Guardar captura de ecrã automaticamente após ser feita

source: Clipboard action which should be executed after the screenshot is taken
pt: Ação da área de transferência a executar após fazer captura de ecrã

source: Whether to use a light color mask in the region selection dialog
pt: Definir se deve ser utilizada uma máscara de cor clara no diálogo de seleção de região

source: Whether the screenshot should be captured after selecting the region and releasing the mouse
pt: Definir se a captura de ecrã deve ser feita após selecionar a região e largar o rato

source: Remember the last rectangular region
pt: Memorizar a última região retangular

source: Default languages for OCR text recognition
pt: Idiomas padrão para reconhecimento de texto OCR

source: The last used region the user selected
pt: A última região selecionada pelo utilizador

source: Take screenshot on click
pt: Capturar ecrã ao clicar

source: Whether the mouse cursor is included in the screenshot
pt: Se o cursor do rato está incluído na captura de ecrã

source: Whether the mouse cursor is included in the video
pt: Se o cursor do rato está incluído na gravação de ecrã

source: Whether the window decorations are included in the screenshot
pt: Se as decorações de janela estão incluídas na captura de ecrã

source: Whether the window shadow is included in the screenshot
pt: Se a sombra de janela está incluída na captura de ecrã

source: Only capture the current pop up menu
pt: Capturar apenas o menu de contexto atual

source: Quit after saving or copying an image
pt: Sair após guardar ou copiar uma imagem

source: Delay
pt: Atraso

source: Default filename
pt: Nome de ficheiro padrão

source: Compression quality for lossy file formats
pt: Qualidade da compressão nos formatos de ficheiros com perdas

source: Default save image format
pt: Formato padrão para guardar imagens

source: The filename template used when saving screenshots
pt: O modelo de nome de ficheiro utilizado ao guardar capturas de ecrã

source: The path of the file saved last
pt: O caminho do último ficheiro guardado

source: Last path used for "save as" action
pt: Último caminho utilizado para a ação "guardar como"

source: Default video format
pt: Formato de vídeo padrão

source: The filename template used when saving screencasts
pt: O modelo de nome de ficheiro utilizado ao guardar gravações de ecrã

source: Save &Location:
pt: Guardar &em:

source: Take Screenshot:
pt: Fazer uma captura de ecrã:

source: Create new selection rectangle:
pt: Criar novo retângulo de seleção:

source: Move selection rectangle:
pt: Mover retângulo de seleção:

source: Resize selection rectangle:
pt: Redimensionar retângulo de seleção:

source: Reset selection:
pt: Repor seleção:

source: Cancel:
pt: Cancelar:

# Mouse action
source: Release left-click
pt: Largar o botão esquerdo

# Mouse action
source: Double-click
pt: Duplo clique

# Mouse action
source: Drag outside selection rectangle
pt: Arrastar para fora do retângulo de seleção

# Keyboard action
source: + Shift: Magnifier
pt: + Shift: Lupa

# Mouse action
source: Drag inside selection rectangle
pt: Arrastar para dentro do retângulo de seleção

# Keyboard action
source: Arrow keys
pt: Teclas de seta
